export const COLORS = {
  /** зелёный (акцент, выполненные задачи) */
  primary: '#4CAF50',
  /** голубой (доп. акценты, кнопки, ссылки) */
  secondary: '#2196F3',
  /** светло-серый фон */
  background: '#F5F5F5',
  /** основной текст (тёмно-серый) */
  textPrimary: '#212121',
  /** второстепенный текст, подписи */
  textSecondary: '#757575',
  /** красный для ошибок */
  error: '#F44336',
  /** текст на кнопках с primary цветом */
  buttonText: '#FFFFFF',
  /** цвет оверлея */
  overlay: 'rgba(0, 0, 0, 0.5)',
  /** border color  */
  border: '#ddddddff',
};

export const darkColors = {
  /** зелёный (акцент, выполненные задачи) — оставляем тот же */
  primary: '#4CAF50',
  /** голубой чуть светлее для видимости на тёмном фоне */
  secondary: '#64B5F6',
  /** очень тёмный фон */
  background: '#121212',
  /** светлый текст для контраста */
  textPrimary: '#E0E0E0',
  /** второстепенный текст чуть темнее основного */
  textSecondary: '#B0B0B0',
  /** красный для ошибок, чуть мягче на тёмном фоне */
  error: '#EF5350',
  /** текст на кнопках с primary цветом */
  buttonTextSecondary: '#121212',
};
